package HomeWork2;
/**
 * 3*. Написать программу, которая выводит таблицу квадратов первых десяти целых
 * положительных чисел от 0 до 10
 */

public class Java3dif {

	public static void main(String[] args) {
		int val;

		/** вводим формулу и выводим на экран */
		for (int i = 0; i <= 10; i++) {
			val = i * i;
			System.out.print(val + " | ");
		}

	}

}
