package HomeWork2;
/** 3. Написать программу, которая вычисляет частное двух чисел. */

public class Java3 {

	public static void main(String[] args) {
		
		// вводим в переменные 2 числа
		
		double first = 9.6515151;
		double second = 3.2154;
		
		/** вычисляем по формуле и выводим на экран */
		
		double result = first / second;
		System.out.println(result);
	}

}
